{
  "animation-delay": "Specifies the amount of time to wait from applying the animation to an element before beginning to perform the animation. The animation can start later, immediately from its beginning, or immediately and partway through the animation.",
  "animation-direction": "Sets whether an animation should play forward, backward, or alternate back and forth between playing the sequence forward and backward.",
  "animation-duration": "Sets the length of time that an animation takes to complete one cycle.",
  "animation-fill-mode": "Sets how a CSS animation applies styles to its target before and after its execution.",
  "animation-iteration-count": "Sets the number of times an animation sequence should be played before stopping.",
  "animation": "The `animation` shorthand CSS property applies an animation between styles.",
  "animation-name": "Specifies the names of one or more `@keyframes` at-rules that describe the animation to apply to an element.",
  "animation-play-state": "Sets whether an animation is running or paused.",
  "animation-timing-function": "Sets how an animation progresses through the duration of each cycle.",
  "background-blend-mode": "Sets how an element's background images should blend with each other and with the element's background color.",
  "background-clip": "Sets whether an element's background extends underneath its border box, padding box, or content box.",
  "background-color": "Sets the background color of an element.",
  "background-image": "Sets one or more background images on an element.",
  "background": "Ssets all background style properties at once, such as color, image, origin and size, or repeat method. Component properties not set in the background shorthand property value declaration are set to their default values.",
  "background-origin": "Sets the background's origin: from the border start, inside the border, or inside the padding.",
  "background-position": "Sets the initial position for each background image. The position is relative to the position layer set by background-origin.",
  "background-repeat": "Sets how background images are repeated. A background image can be repeated along the horizontal and vertical axes, or not repeated at all.",
  "background-size": "Sets the size of the element's background image. The image can be left to its natural size, stretched, or constrained to fit the available space.",
  "border-bottom-color": "Sets the color of an element's bottom border. It can also be set with the shorthand CSS properties border-color or border-bottom.",
  "border-bottom-left-radius": "Rounds the bottom-left corner of an element by specifying the radius (or the radius of the semi-major and semi-minor axes) of the ellipse defining the curvature of the corner.",
  "border-bottom": "Sets an element's bottom border. It sets the values of border-bottom-width, border-bottom-style and border-bottom-color.",
  "border-bottom-right-radius": "Rounds the bottom-right corner of an element by specifying the radius (or the radius of the semi-major and semi-minor axes) of the ellipse defining the curvature of the corner.",
  "border-bottom-style": "Sets the line style of an element's bottom border.",
  "border-bottom-width": "Sets the width of the bottom border of an element.",
  "border-color": "Sets the color of an element's border.",
  "border-image": "Draws an image around a given element. ",
  "border-image-repeat": "Defines how the edge regions and middle region of a source image are adjusted to fit the dimensions of an element's border image. The middle region can be displayed by using the keyword `fill` in the border-image-slice property.",
  "border-image-slice": "Divides the image specified by border-image-source into regions. These regions form the components of an element's border image.",
  "border-image-source": "Sets the source image used to create an element's border image.",
  "border-image-width": "Sets the width of an element's border image.",
  "border-left-color": "Sets the color of an element's left border. It can also be set with the shorthand CSS properties border-color or border-left.",
  "border-left": "Sets all the properties of an element's left border.",
  "border-left-style": "Sets the line style of an element's left border.",
  "border-left-width": "Sets the width of the left border of an element.",
  "border": "Sets an element's border. It sets the values of border-width, border-style, and border-color.",
  "border-radius": "Rounds the corners of an element's outer border edge. You can set a single radius to make circular corners, or two radii to make elliptical corners.",
  "border-right-color": "Sets the color of an element's right border. It can also be set with the shorthand CSS properties border-color or border-right.",
  "border-right": "Sets all the properties of an element's right border.",
  "border-right-style": "Sets the line style of an element's right border.",
  "border-right-width": "Sets the width of the right border of an element.",
  "border-spacing": "Sets the distance between the borders of adjacent cells in a <table>. This property applies only when border-collapse is separate.",
  "border-style": "Sets the line style for all four sides of an element's border.",
  "border-top-color": "Sets the color of an element's top border. It can also be set with the shorthand CSS properties border-color or border-top.",
  "border-top-left-radius": "Rounds the top-left corner of an element by specifying the radius (or the radius of the semi-major and semi-minor axes) of the ellipse defining the curvature of the corner.",
  "border-top": "Sets all the properties of an element's top border.",
  "border-top-right-radius": "Rounds the top-right corner of an element by specifying the radius (or the radius of the semi-major and semi-minor axes) of the ellipse defining the curvature of the corner.",
  "border-top-style": "Sets the line style of an element's top border.",
  "border-top-width": "Sets the width of the top border of an element.",
  "border-width": "Sets the width of an element's border.",
  "box-shadow": "Attaches one or more drop-shadows to the box.",
  "caret-color": "The caret is a visible indicator of the insertion point in an element where text (and potentially other content) is inserted by the user. This property controls the color of that visible indicator.",
  "color": "This property describes the foreground color of an element's text content.",
  "filter": "Defines visual effects (like blur and saturation) to an element",
  "font-family": "This property specifies a prioritized list of font family names or generic family names. A font family defines a set of faces that vary in weight, width or slope.",
  "font-feature-settings": "This property provides low-level control over OpenType font features. It is intended as a way of providing access to font features that are not widely used but are needed for a particular use case.",
  "font-kerning": "Kerning is the contextual adjustment of inter-glyph spacing. This property controls metric kerning, kerning that utilizes adjustment data contained in the font",
  "font": "The font property is a shorthand property for:font-style,font-variant,font-weight,font-size/line-height,font-family",
  "font-size": "This property indicates the desired height of glyphs from the font. For scalable fonts, the font-size is a scale factor applied to the EM unit of the font.",
  "font-stretch": "This property selects a normal, condensed, or expanded face from a font family.",
  "font-style": "This property allows italic or oblique faces to be selected. Italic forms are generally cursive in nature while oblique faces are typically sloped versions of the regular face. ",
  "font-variant-alternates": "The font-variant-alternates property is used to specifically select alternate glyphs.",
  "font-variant-caps": "This property is used to enable typographic subscript and superscript glyphs.",
  "font-variant-east-asian": "Allows control of glyph substitution and sizing in East Asian text. ",
  "font-variant-ligatures": "Ligatures and contextual forms are ways of combining glyphs to produce more harmonized forms",
  "font-variant": "The font-variant property specifies whether or not a text should be displayed in a small-caps font.",
  "font-variant-numeric": "Specifies control over numerical forms.",
  "font-variant-position": "This property controls the use of alternate, smaller glyphs that are positioned as superscript or subscript",
  "font-variation-settings": "This property provides low-level control over OpenType or TrueType font variations.",
  "font-weight": "This property specifies the weight of glyphs in the font, their degree of blackness or stroke thickness. ",
  "-gtk-dpi": "Dimension values default for screen resolution",
  "-gtk-icon-filter": "Filter applied to builtin and application-loaded icons",
  "-gtk-icon-palette": "Defines a color palette for recoloring symbolic icons.",
  "-gtk-icon-shadow": "Shadow applied to builtin and application-loaded icons",
  "-gtk-icon-size": " Size used for builtin icons in buttons and expanders",
  "-gtk-icon-source": "Used by widgets that are rendering ‘built-in’ icons, such as arrows, expanders, spinners, checks or radios.",
  "-gtk-icon-style": "Determines the preferred style for application-loaded icons",
  "-gtk-icon-transform": "Transform list applied to builtin and application-loaded icons",
  "-gtk-secondary-caret-color": "This property controls the color of the secondary caret indicator",
  "letter-spacing": "This property specifies additional spacing (commonly called tracking) between adjacent typographic character units",
  "line-height": "This property specifies the box’s preferred line height, which is used in calculating its “layout bounds",
  "margin-bottom": "Sets the margin area on the bottom of an element. A positive value places it farther from its neighbors, while a negative value places it closer.",
  "margin-left": "Sets the margin area on the left side of an element. A positive value places it farther from its neighbors, while a negative value places it closer.",
  "margin": "sets the margin area on all four sides of an element.",
  "margin-right": "Sets the margin area on the right side of an element. A positive value places it farther from its neighbors, while a negative value places it closer.",
  "margin-top": "Sets the margin area on the top of an element. A positive value places it farther from its neighbors, while a negative value places it closer.",
  "min-height": "Sets the minimum height of an element. It prevents the used value of the height property from becoming smaller than the value specified for min-height.",
  "min-width": "Sets the minimum width of an element. It prevents the used value of the width property from becoming smaller than the value specified for min-width.",
  "opacity": "Sets the opacity of an element. Opacity is the degree to which content behind an element is hidden, and is the opposite of transparency.",
  "outline-color": "Sets the color of an element's outline.",
  "outline": "Sets most of the outline properties in a single declaration.",
  "outline-offset": "Sets the amount of space between an outline and the edge or border of an element.",
  "outline-style": "Sets the style of an element's outline. An outline is a line that is drawn around an element, outside the border.",
  "outline-width": "Sets the thickness of an element's outline. An outline is a line that is drawn around an element, outside the border.",
  "padding-bottom": "Sets the height of the padding area on the bottom of an element.",
  "padding-left": "Sets the width of the padding area to the left of an element.",
  "padding": "Sets the padding area on all four sides of an element at once.",
  "padding-right": "Sets the width of the padding area on the right of an element.",
  "padding-top": "Sets the height of the padding area on the top of an element.",
  "text-decoration-color": "Sets the color of decorations added to text by text-decoration-line.\nThe color applies to decorations, such as underlines, overlines, strikethroughs, and wavy lines like those used to mark misspellings, in the scope of the property's value.",
  "text-decoration-line": "Sets the kind of decoration that is used on text in an element, such as an underline or overline.",
  "text-decoration": "Sets the appearance of decorative lines on text. It is a shorthand for text-decoration-line, text-decoration-color, text-decoration-style, and the newer text-decoration-thickness property.",
  "text-decoration-style": "Sets the style of the lines specified by text-decoration-line. The style applies to all lines that are set with text-decoration-line.",
  "text-shadow": "Adds shadows to text. It accepts a comma-separated list of shadows to be applied to the text and any of its decorations. Each shadow is described by some combination of X and Y offsets from the element, blur radius, and color.",
  "text-transform": "Specifies how to capitalize an element's text. It can be used to make text appear in all-uppercase or all-lowercase, or with each word capitalized.",
  "transform": "Lets you rotate, scale, skew, or translate an element. It modifies the coordinate space of the CSS visual formatting model.",
  "transform-origin": "Sets the origin for an element's transformations.",
  "transition-delay": "Specifies the duration to wait before starting a property's transition effect when its value changes.",
  "transition-duration": "Sets the length of time a transition animation should take to complete. By default, the value is 0s, meaning that no animation will occur.",
  "transition": "A shorthand property for transition-property, transition-duration, transition-timing-function, and transition-delay.",
  "transition-property": "Sets the CSS properties to which a transition effect should be applied.",
  "transition-timing-function": "Sets how intermediate values are calculated for CSS properties being affected by a transition effect."
}